app/controllers/feeds_controller.rb

SELECT "items".* FROM "items"
SELECT  "feeds".* FROM "feeds"  ORDER BY "feeds"."id" ASC LIMIT 1
---
  def feed
      @feed_items = Item.all
      @feed_gen = Feed.first

INSERT INTO "feeds" ("title", "link", "language", "copyright", "description", "logo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @feed = Feed.new(feed_params)

    respond_to do |format|
      if @feed.save

UPDATE "feeds" SET "summary" = ?, "owner_name" = ?, "owner_mail" = ?, "category" = ?, "updated_at" = ? WHERE "feeds"."id" = ?  [["summary", ""], ["owner_name", ""], ["owner_mail", ""], ["category", "Categorytest"], ["updated_at", "2016-01-08 10:56:52.467383"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @feed.update(feed_params)

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_feed
      @feed = Feed.find(params[:id])