app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("title", "series", "speaker", "summary", "file_path", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "file_path" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["file_path", "/test/pathj"], ["updated_at", "2016-01-08 11:33:23.129469"], ["id", 1]]